package _01位运算;

public class Demo {
    public static void main(String[] args) {
        System.out.println(1<<35);// 000  **32个0  左移35位  int 型为32位，移动次数超过32，直接取模
        System.out.println(1<<3); // 000  **32个0  左移3位

        /********判断奇偶，用所给的数&1********/
        //奇数转换为二进制最低为必为1，偶数全为0
        System.out.println(31&1);
        System.out.println(30&1);



        /*********获取二进制位是0还是1*************/
        System.out.println(1<<2);
        // 00000001 -> 00000100
        System.out.println(8&(1<<2));
        /*
               00001000
               00000100
               --------
               00000000
         */


        /*************交换两个整数的值***********/

        int a = 7;
        //    00000111
        int b = 5;
        //    00000101
        a = a^b; // a^b = 00000010, 将它赋值给a,此时a = 00000010,b = 00000101
        b = a^b; // a^b = 00000111, 将它赋值给b,此时a = 00000010,b = 00000111
        a = a^b; // a^b = 00000101 ,将它赋值给a,交换结束
        System.out.println(a+"  "+b);

        /***********不用判断求数字的绝对值*********/
        int num1=-20;
        System.out.println(num1+"的绝对值是"+((num1^(num1 >> 31))+(num1 >>> 31)));


        /*********异或，不进位加法***********/

    }
}
